{
  "title": "1b3bbb64-154c-4652-b71b-a76cdb31082a_2._course_introduction",
  "sourceFile": "1b3bbb64-154c-4652-b71b-a76cdb31082a_2._course_introduction.pdf",
  "extractedAt": "2025-05-07T15:33:04.179Z",
  "contentLength": 8500,
  "content": "\n\n\n2. Course Introduction\nStatusDone\nHarald Rating\nAmino Rating\nIntroduction\nIf youʼve made it this far, it means youʼre interested in becoming great. Thatʼs a \ngood sign – that means youʼre driven. If youʼre able to stay driven throughout this \ncourse, you will become great.\nYouʼve already been introduced to me, so now letʼ   s introduce you to this course:\nThe Course Basics\nThis course consists of practical, and theoretical steps (papers) that will help \nyou fundamentally understand why certain videos go viral, and others don't.\nThis is a “two-sided courseˮ. One for writing, written by Nick, and one for \nediting, lead by me. Sometimes these courses overlap, like in the paper \n“Understanding YouTubeˮ.\nTogether, these two sides cover everything that makes you a great YouTuber – \nbut learning both sides takes years and years. So for now, letʼ  s focus on \nmaking you a great editor.\nWe learn from this guide by studying the papers first, then applying them in a \n“test edit.ˮ By studying each paper before applying it to our test edit, we can \nmore easily grasp and practice the complex concepts weʼre teaching.\nThe People\n2. Course Introduction1\n\nThe editing part is written by me and a select few of the best editors in the \nindustry.\nThe instrumental, along with the flow and sound design papers, were written \nby Armin Nemeth. He was the original editor on Dr. Insanity three years ago \nand is widely regarded as one of the best at conveying emotion through \nediting. Across all his videos, Armin has amassed over 400 million views.\nThe ‘Clip Selectionʼ p aper was written by Ayoub Chicha, an excellent lead \neditor whoʼs been with the team for nearly two years. Starting as a junior, he \nnow manages three editors and has accumulated over 200 million views across \nhis career with us.\nThe Technical Guide was written by Nick Rice. With a background in high-level \ngraphics and communication, and over two years leading all VFX on the \nchannel Rebound, Nick is an exceptional problem solver and a true graphics \ngenius. Check out his work here.\nThe Papers\nThe theoretical side of this course consists of papers, helping detail out some \nof the most important aspects of video creation.\nThere are a total of 7 papers, split up in 3 segments, explaining each aspect of \nviral storytelling (editing).\nYouʼre already on paper 1.\nThe Very Basics\n Course Introduction This Paper)\n Editing Fundamentals - An overview of a great video.\n Understanding YouTube - What makes a good YouTube video perform \nwell?\n Making the viewer happy - What hooks a viewer to watch 30 minutes?\n Clip Selecting - How to properly communicate through visuals\nThe Deeper Skillset\n Flow, Pacing and Sound Design - Make your audience FEEL the video.\n2. Course Introduction2\n\n Instrumentals - The most underrated, but probably most important part of \nediting.\nTechnical\n Technical - Sound mixing, Color Correction, Rendering: Make your video \nperfect.\nAfter youʼve gone through all of these guides: You will, most likely, already be \nsignificantly better. After that, itʼs about practicing, and implementing all of this \nto your craft – eventually making you great.\nLetʼ  s go into the practical.\nThe Practical\nIn this course, you will receive a thumbnail, script, narration, and footage – all \nfrom a real video we plan to post – as well as access to our “Assets Pack Mini.ˮ \nYour goal is to create a perfect 1.5-minute intro + first section to a YouTube \nvideo.\nIf the trial is good enough to post when youʼre finished, you get to continue on \nthe full video. If thatʼs good enough to post, you will be fully paid as one of our \nreal editors.\nTo achieve this, you will have to study the different papers previously \nmentioned in a very specific order which I will mention in a second. After each \npaper, you will receive a short quiz on itʼs contents – this is to challenge your \nlearning & make sure youʼre picking up on what you read.\nThe papers, and practical work, will be done in this order:\n Read introduction (this paper)\n Reading Papers: Before even getting started on the 1.5 minutes, we want \nyou to read through 3 fundamental papers - that lays the groundwork of \nyour YouTube knowledge. These papers include:\na Editing Fundamentals\nb Understanding YouTube\nc Making the viewer happy (intro + more)\nd Clip Selecting\n2. Course Introduction3\n\n Quiz: Make sure you actually learnt things from the papers.\n Editing 1.5 minutes: After having studied these papers, youʼre good to start \nworking on the first 1.5 minutes. By this point you have a pretty good idea \nof what makes a great video great. Work on this until youʼre happy with the \nresults – and ensure these 1.5 minutes follow the guides youʼve read so far \nin detail.\n Review: At this stage, you should submit your results to your lead \ncontact. They will evaluate your work to determine whether itʼs worth \ncontinuing the course for you.\n Approval/Denial: If your lead contact decides youʼre good enough to \nbecome great, you will get access to 2 more guides.\n Reading Papers: Here you get access to two very crucial guides to making \na great video\na Flow, Pacing and Sound Design\nb Instrumentals\n Quiz: Make sure you actually learnt things from the papers.\n Editing 1.5 minutes: After having studied these papers, you will likely \ncatch a lot of mistakes with your current trial. The goal is to update, \nrefine and fix your 1.5 minutes to follow all the new things youʼve learnt \nfrom these two guides.\n Review: At this stage, you should submit your results to your lead \ncontact. They will evaluate your work to determine whether itʼs worth \ncontinuing the course for you.\n Approval/Denial: If your lead contact decides youʼre good enough to \nbecome great, you will get access to the final guide.\n Reading Papers: If you get approved, you will get access to the final guide.\na Technical\n Quiz: Make sure you actually learnt things from the paper.\n Review: At this stage, you should submit your results to your lead contact. \nIf they decide your video is good enough, it will make it all the way to me.\n2. Course Introduction4\n\n Review by me: If youʼve made it this far, it means youʼre pretty damn good. \nHowever, we have exceptionally high standards. At this point I will review \nyour video, and decide if youʼre good enough to be brought onto the team.\n Intro  F  undamentals\na Before even getting started on the 1.5 minutes, we want you to read \nthrough 3 fundamental papers - that lays the groundwork of your \nYouTube knowledge. These papers include:\ni Editing Fundamentals\nii Understanding YouTube\niii Making the viewer happy (intro + more)\niv Clip Selecting\nb Complete a quick quiz to confirm youʼve absorbed the basics.\n First 1.5 Minutes\na After having studied these papers, youʼre good to start working on the \nfirst 1.5 minutes. By this point you have a pretty good idea of what \nmakes a great video great. Work on this until youʼre happy with the \nresults – and ensure these 1.5 minutes follow the guides youʼve read so \nfar in detail.\nb Submit your work for a Review.\n Review\na At this stage, you should submit your results to your lead contact. They \nwill evaluate your work to determine whether itʼs worth continuing the \ncourse for you.\n Advanced Guides\na Here you get access to two very crucial guides to making a great video\ni Flow, Pacing and Sound Design\nii Instrumentals\nb Complete another quick quiz.\n2. Course Introduction5\n\nc Refine/update your 1.5 minutes based on what you learned, then submit \nagain for a Review.\n Second Approval or Denial\na If approved, you get the final guide.\n Final Guide\na Read the “Technicalˮ guide, do the final quiz, and polish your 1.5 \nminutes.\nb Submit your final version to your lead contact.\n Final Review\na At this stage, you should submit your results to your lead contact. They \nwill evaluate your work to determine whether itʼs worth continuing the \ncourse for you.\nb If youʼve made it this far, it means youʼre pretty damn good. However, \nwe have exceptionally high standards. At this point I will review your \nvideo, and decide if youʼre good enough to be brought onto the team.\nThatʼ   s it. Fewer steps, same process. Hope it feels less overwhelming!\nOutro\nIn other words, we have a very rigid system to make you great. If you can pull it \noff, I will personally help you make it perfect. If you manage that, youʼre hired.\nNow letʼ   s get into the guides.\n2. Course Introduction6"
}