{
  "title": "829f1445-9fcb-4104-8e99-35f14084705c_1._the_editing_manifesto",
  "sourceFile": "829f1445-9fcb-4104-8e99-35f14084705c_1._the_editing_manifesto.pdf",
  "extractedAt": "2025-05-07T15:33:04.284Z",
  "contentLength": 5792,
  "content": "\n\n\n1. The Editing Manifesto\nStatusDone\nHarald Rating\nAmino Rating\nBefore you get started\nIʼll st art by saying this: If youʼre an editor looking to make some quick, easy, \nmoney on freelance projects, no strings attached – let your lead contact know, and \nwe will go separate ways. No hard feelings, we will simply not be compatible, and \nthatʼ  s entirely fine.\nIf youʼre looking to become an exceptional, sought after, editor; and make a \nsuccessful career in editing  – this is exactly where you want to be.\nWeʼre only interested in hiring people who want to become great. People who love \ncreating content, just like we do: those who are ready to aim high, grow with us, \nlearn from their experience, and eventually reach a point where they lead an \nediting team, manage a YouTube channel, or, better yet, collaborate with us on \neven bigger projects.\nWe will never waste time on an editor who doesnʼt want to become great.\nIn the last seven months, we have grown from:\n4 employees → Over 30 employees\n800K subscribers → Over 2.2M subscribers\nLow-quality clickbait videos → The highest-quality true crime \ndocumentaries on YouTube\nThis isnʼt luck. Itʼ s the result of a dedicated team working together to improve and \nbuild something remarkable.\n1. The Editing Manifesto1\n\nContext - Backstory & Philosophy\nBackstory\nIʼ m Harald, co-founder of MATCHER (along with Nick) and the production manager \nfor all Insanity projects.\nFour years ago, I started my journey on YouTube by editing per-video projects – \njust like the role you're starting with us. Those gigs eventually sharpened my skills \nto the point where random channels wanted to hire me full-time. However, with \nschool, I wasnʼt ready to commit.\nAfter a year of working part-time as an editor on the side of school, I finally made \nthe leap: I quit school and moved to Washington, D.C to work for a channel called \nRebound, where I led a team of four editors for two years.\nEventually, Rebound had taught me everything they could: I felt I had to start \nsomething on my own.\nI left D.C. and started my own venture with my business partner Nick: Dr. Insanity\nWe now live in L.A. and are working fiercely to make Dr. Insanity into something \nabsolutely huge: bigger than just a YouTube channel.\nWhy this matters\nThese experiences shaped my belief in a very specific philosophy. Anyone can go \nfrom YouTube side gig projects, to running entire channels: itʼs all about \nopportunities, time, and dedication.\nWe will provide you with the opportunity to take this path – to learn from some of \nthe very best. In return, you will provide us with your time and dedication to \nensure that the knowledge and effort we invest in you donʼt go to waste.\nI promise you, if you put in the effort, we will turn you into a highly, highly, sought-\nafter editor.\nAnd if you become a highly sought-after editor, you will secure full-time work with \nus guaranteed: and if you donʼt wish to work for us, guaranteed elsewhere too.\nHow this will work\n1. The Editing Manifesto2\n\nThis position offers a clear path for growth within Dr. Insanity. All new editors start \nwith Insanity Bodycam, where we pay an average of $400 per video.\nWe provide you with assets, templates, instrumentals, and any tools you might \nneed to succeed. But most importantly, we provide our in depth training courses, \nand direct feedback on your videos.\nNick and I, the owners, have collectively amassed over 10 billion views across all \nplatforms. Nick was IShowSpeedʼs manager until just a few months ago:  believe \nit or not, heʼs the one who originally helped him blow up. I got bored last week, \nand decided I wanted to blow up on TikTok again - so I did it.\nWe know what makes a viral, great video; and if youʼre willing to learn, we will \nteach you.\nEditors who demonstrate exceptional dedication, genuinely listen, and apply our \nfeedback will advance to our main channel: Dr. Insanity. There, youʼll st art as a \nfreelancer paid hourly. If you can handle the higher skill level, weʼll soon bring you \non as a full-time editor.\nIf youʼre curious about this, I can set up calls with our editors whoʼve already \ntaken this path.\nCompensation\nPart-time\nBase rate: $15 per minute of final video\nTypical video length: 1530 minutes\nPotential earnings: Up to $450 per video. Minimum pay $200.\nPerformance bonuses available If you do great work we will reward you, \nsimply because we need great people around.)\nKeep in mind 99% of motion graphics are already done with templates, and \nbodycam would be linked in the script with timestamps.\nStarting Full-time (Junior)\nFull-time work 8 hours / day, 5 days / week)\n1. The Editing Manifesto3\n\n1 Week Paid Vacation\nBase salary: $2,000 monthly\nThis goes on for up to 6 months, then  $2,500 monthly salary and 2 weeks \npaid vacation\nFull-time (Senior → Lead Editor)\nMonthly salaries  Position\n$3,000 Senior)\n$5,000 Lead)\n$7,000 Manager)\nAnyone and everyone can climb the ladder in our company: All that matters is your \ncommitment to learning & growing.\nThe Insanity Training Course\nAs Iʼ  ve said before, we only work with people who want to become great. For that \nreason, weʼve developed a very unique training program for driven editors.\nOur training program is hands-on – youʼll be working on a real video that we plan \nto post. If this video becomes good enough for us to post anywhere, you will be \npaid for all your time.\nIn other words:\nIf you spend the time to properly follow and learn from this course, not only will \nyou become a much greater editor, but you can also be confident that your time \nwill be well compensated.\nWith all of this said:\nIf youʼre ready to become great, message your lead contact and they will set up \nthe beginning of your journey with us.\nTake Care,\nHarald\n1. The Editing Manifesto4"
}