{
  "title": "8601ddb0-3cf5-43dc-987d-ca6cf2b98dd1_NICKS_What_Makes_a_Good_Video__A_Complete_Guide",
  "sourceFile": "8601ddb0-3cf5-43dc-987d-ca6cf2b98dd1_NICKS_What_Makes_a_Good_Video__A_Complete_Guide.pdf",
  "extractedAt": "2025-05-07T15:33:04.309Z",
  "contentLength": 7782,
  "content": "\n\n\nNICKS: What Makes a Good \nVideo? | A Complete Guide\nWhat Makes a Good Video? | A Complete Guide\nThis guide is written with the objective of shifting your perspective to see things \nthat most won't, enabling you to create a video that surpasses the competition.\nTo do this, weʼll br eak it down with the following sections:\nVideo Atmosphere\nPacing/Holding Retention\nSound Design\nMotion Graphics\nIntro\nVideo Atmosphere\nWeʼll always say that the general “vibeˮ of a video is the most crucial part of a \ngood video.\nThe vibe or atmosphere sets the entire tone for the video.\nTo make the best content, itʼ    s important the vibe is very clear. The second you \nclick, it's obvious what emotion the video is geared towards.\nThis is all to add intrigue. If you click to see a bland, emotionless video– you feel \nnothing. Thereʼs no emotional tie from video to viewer.\nTypically you should look to stick within one of these vibes:\nIntense\nEmotional\nFunny (has to be extremely funny)\nNICKS What Makes a Good Video? | A Complete Guide1\n\neerie\nWhen setting a vibe for a video, try to think in the most generic, logical way \npossible.\nFor example, if I'm looking to write a crime video titled “A Detective Realizes The \nSuspect Is Dyingˮ The obvious vibe would be extremely eerie and shocking. I \nwould look to make the viewer have their mouth wide open after just 20 seconds \nof watching.\nUse super ominous instrumentals, loud risers, impacts, etc. to convey this vibe to \nthe fullest.\nCreate an emotional atmosphere behind every video, or else it will carry no \nweight.\nFWI We made this video. Go check it out, let me know how we did)\nLink\nAlso– instrumentals are crucial in setting the vibe. Pay very close attention to \ninstrumental choices, especially in the beginning of the video. Don't be afraid to \ntry 5 different instrumentals until you find the perfect fit.\nPacing/ Holding Retention\nVideo pacing can fluctuate heavily depending on the type of content your \nproducing, but there are a few fundamentals that follow for all.\nOptimization\nAlways look to cut as much fat as possible without destroying storyline context. \nThere should be very little dead space, and any bits of commentary irrelevant to \nthe direct storyline of the section should be removed.\nThe majority of comments I make on video drafts are “Cut this clip to be ½ as \nlongˮ\nWhen watching a video back, pay attention to moments where your brain starts to \nthink about something else or dozes off. This is typically a sign your pacing is too \nslow.\nVariety\nNICKS What Makes a Good Video? | A Complete Guide2\n\nMake sure your video doesn't have extremely repetitive pacing throughout. For \nexample, if you have 4 sections all exactly equal in length, the video starts to feel \ndrawn out– almost like a song with no verses or switch-ups.\nAim to have some longer sections, followed by some short, followed by medium \nect.\nInstrumental Swaps\nAny time something changes in your video, whether it's a section ending, or \nintensity ramping up– look to swap instrumentals.\nEven if the vibe of the instrumental is exactly the same, just having a new melody \ncome in can be extremely reengaging.\nYou can very easily swap instrumentals by swapping on an impact or riser, or \ntaking the ending bit of the instrumental and placing it where your looking to \nswap.\nSound Design\nSound Design is super underrated, it's like the icing on the cake.\nIf you get brought onto the team, we will give you a a sound effects library with \nevery sound effect you will ever need. For any trial youʼre making, I want you to \npick the sound effects yourself. Try to make it as strong as possible.\nIn terms of adding SFX, make sure there's plenty of rises & crashes during any \nswap or dramatic moment. These just add that extra bit of taste, and can be \npaired with visual effects.\nAlso pay attention to audio mixing, specifically the instrumental volume on mobile– \nand the quality of VO on mobile. Bad mixing is a massive turnoff for most viewers.\nThe last thing you want is for a viewer to click off an amazing video because you \nforgot to raise the VO volume.\nMotion Graphics\nThis is like the most annoying part of making a good video lol.\nMotion graphic standards on YouTube are higher than what the average editor can \nproduce, so it's really hard to get something made quickly thats as good as most \nYouTube videos.\nHowever, there are a few methods to combat this\nNICKS What Makes a Good Video? | A Complete Guide3\n\nTo understand what good motion graphics look like, refer to this video we worked \non a couple months ago.\nMeet The 6'10 Ai Robot NBA Players Fear..\nNotice how all graphics are extremely smooth, and add a feeling of high \nproduction quality. We want everything to flow nicely, are balanced and \nsymmetrical– And most important, LOOK COOL. Motion graphics just need to look \ncool.\nHeres an example of a well-made article animation, vs a poorly made animation\nGood:\nPay attention to the attention to detail, and general aesthetic. This looks \nprofessional\nBad:\nNICKS What Makes a Good Video? | A Complete Guide4\n\nWhat am I looking at... (someone actually charged us for this)\nDo not settle for the bare minimum in this scenario. If you're contemplating \nwhether an animation is good enough, itʼs probably not.\nAlso– look to add visual pointers in as many areas as possible. Refer to this video \nfor examples When The Suspect Is Smarter Than The Detective\nWe constantly point things out via arrow or text. This just adds a bit more visual \ninformation to keep people interested.\nNICKS What Makes a Good Video? | A Complete Guide5\n\nIntro\nIntros convince the viewer whether or not to watch the video. How exactly can we \nmaximize the chance a viewer will stay?\nConfirming Thumbnail\nItʼ s important to note that the viewer clicked on a very specific image and title, so \nif they don't receive what they clicked on right away, it's a major turn-off. Notice \nhow all of MrBeastʼ  s videos immediately deliver on whatever is being shown in the \nthumbnail and title.\nVisual/ VO Bait\nGenerally, try to “baitˮ the viewer into watching both visually, and in the script. For \nexample, if the title is “When Fathers Confront Their Son's Killersˮ  I would look to \nhave VO say “But some dads will go to extreme measures, just to get revenge..ˮ \nand visually show a father about to punch the suspect, then cut to black with a \nbuild-up riser. Iʼ ve just baited the viewer to watch the whole video just so he can \nsee that clip.\nPLEASE don't lie or false promise on the bait. This will cause viewer distrust, and \nthey will stop clicking on future videos. This is why “Clickbaitˮ Y  ouTubers always \nfall off if they don't adjust.\nNICKS What Makes a Good Video? | A Complete Guide6\n\nExtremely Fast Pacing\nThis is pretty obvious, but make sure your intro pacing is faster then the actual \nvideo. Aim to have all of the bait and hooks completed within 15 seconds.\nHere is a very simple first-minute checklist to follow until you start getting the \nhang of things-\nFirst 100 Checklist NOT STRICT\nVery simple and quick visual and VO hook (bait)\nVisuals are very on point to what VO is saying\nInstrumentals are very engaging and fresh feeling\nAs many WOW moment edit opportunities as possible. Video feels high quality\nInclude a line saying there will be multiple sections if the video has multiple \nsections\nFast-paced vocals\nAt least 1 dramatic switch, ideally around 45-second mark\nA few arrows, or circles pointing out something\nIf youʼve read this whole doc, thank you for investing into this company. I assume \nif you take the time to read all of this you will thrive with us. Let's kill it together.\nNow read this all over again because I guarantee you didnʼt retain enough.\nNICKS What Makes a Good Video? | A Complete Guide7"
}