{
  "title": "Insanity Google Earth Guide",
  "sourceFile": "Insanity Google Earth Guide.pdf",
  "extractedAt": "2025-05-07T15:33:04.345Z",
  "contentLength": 4295,
  "content": "\n\nInsanity Video Guide \nHere is a simple tutorial I recorded of myself going through all the steps of this guide. If you’re a \nvisual learner, this will be easy to follow. If you need more specific, detailed, help - you can find \nit in the text guide below. \n \nAlso, if you know certain aspects of it already, feel free to skip to the motion graphics specific \nparts later in the video. \n \n \ngearth_tutorial.mp4\n \n \nTutorial On G-Earth Basics \n \nGoogle Earth Studio - Basics\n \n \nProject Setup \n● Go to https://earth.google.com/studio/ \n● Start a \"Blank Project\" - name should be \"CASE# - Scene #\"  \n○ Example \"CL20 - Victim House 01\" \n● 1920x1080, Duration (your project length), 30FPS \n \nCreating The Scene \n● Find the location you're trying to animate \n○ If there is no 3D height data for the location you’re trying to animate, find \nsomething similar that has 3D data. (Unless it’s very specific to the story) \n● Start by keyframing the shots for the start and end of your animation \n○ You're going to be adding supporting graphics to your animation, so think about \nwhere they will live in the scene - that should inform your animation and where \nyour framing should be. \n● Keep things smooth and easy on the eyes, check out our previous examples of google \nearth scenes: \n○ https://www.youtube.com/watch?v=nqBgCvvcgzQ&t=86s \n○ https://youtu.be/nqBgCvvcgzQ?si=Pe6sWdSczi6Az72U&t=539 \n○ https://youtu.be/hcehrylhJoI?si=pB2xJ2oISmmLkvUU&t=184 \n○ https://www.youtube.com/watch?v=HTXkfnLH04A&t=536s \n○ https://youtu.be/EoUEFWnU1AE?si=Fv9rs__rCMJ-my89&t=79 \n○ https://youtu.be/EoUEFWnU1AE?si=h5OZkHqv71rCtqq0&t=110 \n \n● If you'd like, you can add more attributes on the left panel  \n○ “Field of View” or “Camera Target” are good to use.  \n● Refine the animation with the graph editor if needed \n○ Right click on the timeline > “Show Graph” \n \nTracking Points \n\n● Right click on an area in the scene you want 3D tracking data for to use in After Effects - \nselect \"Set Track Point\"  \n○ Do this for any space you think you'll need tracking for, it will make your job a lot \neasier later on.  \n● Once you're done, you should see a panel on the left that says \"Track Points\"  \n○ If you don't see it then go to \"Overlay > Show Overlays Panel\", change the \ndropdown on the panel from \"Overlays\" to \"Track Points\"  \n● Select a track point you want to be your \"Center Origin\" of 3D Space, i.e (0,0,0). Click \nthe 3 dots on the side and select \"Set As Local Origin\".  \n○ If you don't do this, your 3D points in After Effects will have extremely large \nnumbers like (52354325423543, 743892574032, 235432754932758) \n \n \n \nExporting \n● Save your scene first \"File > Save\" - then at the top right hit \"Render\" \n● Set the \"Name\" and the \"Destination Folder\" \n● Choose \"Image Sequence\"  \n● “Attribute Position\" should be “Bottom Right”, with “X=1500” and “Y=960”, \"Text \nAlignment\" set to “Right”. \n● In the “Advanced Section” under \"3D Tracking Data\" choose \"After Effects\" and set the \n\"Coordinate Space\" to \"Local\" \n● “Map Style” should be \"Clean\" and “Texture Quality” should be \"High\"  \n● Then click “Start”.  \n \n\n \n \nImport To After Effects \n● Go to  \"File > Scripts > Run Script File\" then find the folder your render saved too. There \nshould be a \".jsx\" file that is saved with it, select that.  \n● After Effects now should have made a composition for you with the render, camera data, \nand all the track points you made.  \n\n○ You can delete the text layers as the nulls are just fine \n \n \nG-Earth Template \n● Import the template found HERE  \n● Inside you'll find “Main - Google Earth”, “Graphics - Copy & Paste” and “Fake DOF \nSetup” \n● Main - Google Earth \n○ This should be your “Final Render” comp - place your imported G-Earth comp \nunder the post processing adjustment layers. Adjust the time if needed. \n○ You need to scale your G-Earth comp slightly so we don't see the “Google” \nwatermark. \n● Graphics - Copy & Paste \n○ This comp contains any supporting graphic you might need for your G-Earth \ncomp. Simply copy and paste these graphics into your comp and arrange them in \nyour scene.  \n \n \n \n● Fake DOF Setup \n○ These adjustment layers help give your footage a nice DOF effect, it also helps \nblur the “Google” watermark. Copy these layers to your G-Earth comp and follow \nthe instructions. \n "
}