{
  "title": "INSANITY INTRO GUIDE V1",
  "sourceFile": "INSANITY INTRO GUIDE V1.pdf",
  "extractedAt": "2025-05-07T15:33:04.399Z",
  "contentLength": 13993,
  "content": "\n\nINSANITY INTRO GUIDE \n \nHey all! I'm Nick, owner of Dr Insanity and its subsidiaries. \n \n2025 will be a big year for the channel(s), as we hope to break all the boundaries in the True \nCrime space. I personally have the goal of helping create the most talented and well-respected \nteam of creatives I possibly can. \n \nAs I'm sure most of you are aware, the intro is the most important part of a YouTube video. The \nintro sets the entire ceiling for a video – it intrigues the viewer, makes them feel inclined to learn \nthe outcome of the story, and gives them enough information to quickly determine if the video \nconcept is something they want to watch. \n \nThink about it: \n \nOur videos can sometimes span up to an hour long. We have 30 seconds to convince the \nviewer to watch an entire hour-long video! \n \nThe number of possible intro variations is almost infinite, so building the most accurate intro can \nbe quite the challenge. Hopefully, this guide can help you better understand what a “good” intro \nshould look like, so that building highly intriguing intros will no longer be a challenge. \n \nTechnical Understanding of Intros \n \nI’d first like to start this guide by pre-facing the algorithmic reason why intros are so important. \n \nWhat makes a YouTube video get millions of views? \n \nYouTube determines a video’s quality by ranking it against other videos in a similar niche. A \nvideo’s quality is measured using a whole array of micro analytics, but the two most key metrics \nto understand are: \n \nClick-through rate (CTR): What % of people who see your video, click on your video. \n \nAverage Viewer Duration (AVD): The average time someone spends watching the video \nbefore clicking off. \n \nBelieve it or not, both of these metrics are incredibly dependent on the intro. I’ll explain why. \n \n\n \n \nCTR In Relationship With Intros \n \nSimply put, when someone clicks on a video, they expect to see exactly what they clicked on. \n \nFor example: \n \n \nHere is a video we uploaded, which got over 12,000,000 views in just a few months. Observe \nthe title and thumbnail photo, and then watch the intro of the video: \n \n \nMan Horrified After Learning Girlfriend's Evil Secret\n \nInstantly, we show exactly what the viewer clicked on. This is extremely important, otherwise, \nthe viewer will feel deceived and “clickbaited”. \n \nAlways make sure you confirm the title or thumbnail as quickly as possible in the intro. Ideally, \nthe first clip the viewer watches is the exact frame from the thumbnail. \n \nAVD In Relationship With Intros \n \nIntro’s obviously play an incredibly important role in maintaining a high AVD on a video. \n \n\n \n \nHere is a video we uploaded 30 days ago that has nearly 7,000,000 views. By looking at the \nretention graph, we can see that the intro was key in outperforming previous videos.  \n \nWe made a better intro than normal, and as a result, the AVD remained higher than average \nthroughout the entire video. \n \nThe intro sets the ceiling for an entire video’s success. \n \nPsychological Understanding of Intros \n \nTo create a good intro, it’s crucial to understand why an intro is “good” in the first place. \n \nGenerally, a good intro will achieve 2 things: \n \n-Immediately hook the viewer with some form of spectacle \n-Give the viewer a strong reason(s) to watch the ENTIRE video \n\nI’ll break these down even further: \n \nCreating Spectacle \n \nIf you look at some of the biggest videos on YouTube, all of them have some form of spectacle \nthat separates their video from others. \n \nFor example, in MrBeast’s video “Survive 100 Days In Circle, Win $500,000” – MrBeast decides \nto drop the house instead of starting the video with it already placed, in order to create a \nspectacle to catch viewers by surprise: \n \nhttps://youtu.be/gHzuabZUd6c?si=JJ-VsGcfvYkNl0ee&t=15 (0:15) \n \nIn our case, we usually want to create a spectacle by shocking viewers in the intro. We want to \ntake the concept shown in the title and thumbnail, and make it 100 times more extreme than \nwhat the viewer had initially prepared for. \n \nTake a look at this creator who reacted to our video: \n \nhttps://youtu.be/4UN5RxiIxlQ?si=63MIqrQoaRlbV7PF&t=130 (2:10) \n \nHe is literally jaw-dropped by the information he just learned. I meticulously placed the fact that \nthe couple had killed their own parents at the end of the intro, to leave viewers with information \nso extreme that they’ll have no choice other than to continue watching. \n \nIf the viewers aren’t jaw-dropped like this when the intro finishes, then we haven’t done a proper \njob creating the intro. \n \nStrong Viewer Incentive \n \nIt’s very important to ensure you leave viewers with a clear reason to continue watching.  \n \nIf we reveal too much information in the intro, then the viewer will have no reason to watch the \nrest of the video, as they’ve already digested all the interesting parts of the case. \n \nGenerally, I like to build the intro with open-ended shock. This means that I’m able to shock the \nviewers with extreme facts about the case, but in a way that doesn’t spoil what's to come. \n \nAdditionally, I like to showcase all the various types of footage we have in the video.  \n \nFor example: \n \n\n \n \nIf our video follows this format, then it’s crucial to show visual footage from each of these \nsegments in our video, so that the viewer fully understands what's to come– and hopefully feels \nthe need to stick around as a result. \n \nIntro Formatting \n \nThe best way to consistently make very good intros in a quick manner, is by nailing our various \ntypes of intro formats. \n \nIf you look at some of our recent videos, you’ll see all of the intros follow a very similar format, \nusually starting with “This is [SUSPECT NAME]”. \n \nBelow is a set of proven formats we have used on videos with millions of views. \n \n*You do not have to use these formats 1:1 for every intro you work on. These are simply \nrecommendations. Every video is different* \n \nFormat 1: General Dr Insanity Format \n \nPlay a clip of moments leading up to the thumbnail frame \n \nPause on thumbnail frame \n \nThis, is [SUSPECT AGE] year-old [SUSPECT NAME]. \n \nExplain what happened before this moment. Example: \n \nJust hours ago, [SUSPECT NAME] brutally killed his wife, [WIFE’S NAME]. \n \nPlay clips of police on scene discussing dead wife \n \nExplain what the suspect said happened, or why police think he’s suspicious. For example: \n \nAt first, [SUSPECT NAME] would claim someone broke into their house, killing [WIFE’S \nNAME]. However, as officers further investigated the case, strange clues began to \nemerge that would paint [SUSPECT NAME], as the killer, of his own wife... \n\n \nPlay clips of cops finding strange clues, and the suspect getting visibly frustrated while being \nquestioned. End on a spectacle. \n \nINSANITY LOGO ANIMATION PLAYS. End of intro \nhttps://youtu.be/nqBgCvvcgzQ?si=r-4X5JER4hYO699e&t=81 \n \nAn example of this format being used in our video: \n \nMan Terrified After Learning Roommates Evil Secret\n \n \nFormat 2: Real time, Cop POV \n \nExplain the thumbnail clip in real-time: \n \nAn officer arrives on the scene of a standard disturbance call. \n \nExplain how they learned about the disturbance: \n \nA neighbor reported shouting had come from the house, and quickly called 911. \n \nForeshadow how the case is way worse than officers expect: \n \nThe officer doesn’t realize it yet, but what would lie inside the home was MUCH worse \nthan he could have ever prepared for... \n \nPlay extreme clips showing the insanity of the situation. \n \nOPTIONAL: Reveal the suspect is a relative/friend/has a relationship to the victim \n \nEven worse, is that [VICTIM NAME] wasn’t just killed by a home intruder, like [WITNESS \nNAME] claims – instead, it would be someone much, much closer to [VICTIM NAME]... \n \nPlay clips of killers, end on spectacle. \n \nINSANITY LOGO ANIMATION PLAYS. End of intro \nhttps://youtu.be/nqBgCvvcgzQ?si=r-4X5JER4hYO699e&t=81 \n \nAn example of this format being used in our video: \nhttps://youtu.be/KoEzb2eAFkQ?si=_qGmcDUfOIoLyBI_ \n \n \n \n\nFormat 3: Real time, Suspect POV \n \nPlay a clip of moments leading up to the thumbnail frame \n \nPause on thumbnail frame \n \nThis, is [SUSPECT AGE] year-old [SUSPECT NAME]. Just hours ago, he would brutally \nkill his roommate, [ROOMMATE NAME]. \n \nThe cops have no idea, and are unaware of the meticulous planning that went into \ncovering up this brutal murder... \n \nPlay clips of killer pretending to be innocent \n \nOver the course of the next few days, detectives would do everything they could to track \ndown the killer, and bring justice to [VICTIM NAME]. \n \nBut, [KILLER NAME] wasn’t going to make it easy... as he had plans to completely get \naway with the murder... \n \nPlay clips of killer swindling cops, and cops confused as to who could have done the crime. End \non a spectacle. \n \nAn example of this format being used in our video: \n \nCollege Killer Thinks He's Getting Away With It\n \nUnderstanding The Final Outcome \n \nOne special characteristic I have that often separates scripts I've written from others, is that I \ndeeply understand what the final product will look like. When I’m writing, I'm envisioning what \ntypes of instrumentals will be playing, what type of edit ideas the editors will use, and how the \ncomplete video will look – not just the script. \n \nHere are a few things I'm always thinking of when writing the script: \n \nInstrumental Choice \n \nIn a lot of my scripts, I will literally go and find an instrumental myself, for the editors to use (and \nin rare cases, produce the instrumental entirely). \n \n\nNow, by no means am I asking you to do this – however, I strongly recommend paying attention \nto the instrumental choice used in the intros of our latest videos. Take note of these, and try to \nremember them when creating a strong emotion in the intro. \n \nTip: Sometimes, I will actually play an eerie instrumental on loop so that I can gear the emotion \nof the intro to fit the instrumental. Here are a few I listen to: \n \nhttps://youtu.be/Fn_2KclAeVU?si=DybPsV9O9AJbgbQf \n \nhttps://youtu.be/yK54v3pZdx0?si=nUtM2JUyp0vIMSlT \n \nhttps://youtu.be/R5z5j0KG4aE?si=p0RAdehH9xn9-JpD \n \nEditing Ideas \n \nTry to analyze our recent video’s intros and observe what types of edit ideas we use commonly. \nIf you can remember these, you’ll be able to use these ideas yourself to build out the intro. \n \nI want you to find these yourself for learning purposes, but look for things like the various 911 \ncall graphics we use, the types of 3D animations we use, and the various Google Maps \nanimations we implement. \n \nHere’s an example of a script I wrote with an influx of editor ideas. This video got over \n20,000,000 views but unfortunately got taken down: \n \n \nParents Realize Their Daughter Is A Mass Murderer: Editors Notes\n \nChecklist \n \nThe following is a set of questions you should ask yourself before submitting any intro. It is \ncritical to do this immediately, otherwise, you will forget the information you’ve learned in this \nguide. \n \nHook & Spectacle: Have I hooked the viewer within the first few moments?  \n \nFor example, does the intro contain an unexpected or shocking element (a spectacle) that will \ngrab attention immediately? \n \nTitle/Thumbnail Confirmation: Does the intro quickly confirm the promise \nof the title and thumbnail? \n\n The viewer clicked for a reason – have I shown them that exact scenario or subject right away \nso they don’t feel misled? \n \nStrong Reason to Watch On: Did I give the viewer a compelling reason to \nkeep watching the entire video?  \n \nBy the end of the intro, the viewer should be intrigued and want to know what happens next \n(e.g. an unanswered question or an unresolved situation). Is there a clear element of mystery or \nsuspense introduced? \n \nAvoiding Spoilers: Did I reveal just enough without giving away the whole \nstory?  \n \nMake sure you haven’t spoiled the ending or key twists in the intro. The intro should tease the \ncontent, not summarize it. Are the most shocking facts delivered in an open-ended way? \n \nMultiple Footage/Element Tease: Does the intro preview the different \nelements of the video to come? \n \n If the story involves things like a 911 call, bodycam footage, interviews, crime scene photos, \netc., have you included a glimpse of each (as appropriate) in the intro? This gives the audience \na “preview” of the storytelling tools and keeps them curious about those segments. \n \nFinal Moment Impact: Does the intro end on a dramatic high note \n(spectacle) just before the Insanity logo plays?  \n \nThe last line or visual of the intro should be the most intense or compelling moment that leaves \nviewers eager to continue. Ensure you marked the end of the intro clearly (with the logo or a \ntransition). \n \nTone and Emotion: Is the tone of the intro appropriate and engaging?  \n \nCheck that the emotional tone (suspenseful, eerie, urgent) matches the content. Would \nbackground music and editing enhance this intro? (If possible, imagine the kind of instrumental \nthat might play – does your intro’s pace and mood fit with that music?) \n \nPacing and Length: Is the intro concise and within the recommended \nlength?  \n \nAim for roughly 30–45 seconds. If your intro script seems too long-winded, trim unnecessary \ndetails. Every sentence should either build the intrigue or push the story forward quickly. \n \n\nClarity and Polish: Have I proofread the intro for clarity and errors? \n \n Ensure the narration is clear and easy to follow. Check for any typos, grammatical mistakes, or \nconfusing phrasing. Also confirm all names, ages, and facts mentioned are accurate and spelled \ncorrectly (consistency is key for credibility). \n \nSelf-Audit: Would this intro make me want to watch the full video if I were a \nviewer?  \n \nPut yourself in the shoes of someone who just clicked on the video. Does the intro fulfill what \nyou’d hope to see and leave you excited to find out more? If you hesitate at all, refine the intro \nuntil the answer is yes. \n \n \n \nGood luck!!! \n \n-Nick "
}